"""
Упражнение 2. Приветствие
(9 строк)
Напишите программу, запрашивающую у пользователя его имя. В ответ
на ввод на экране должно появиться приветствие с обращением по имени,
введенному с клавиатуры ранее.
"""

user_name = input('Введите пожалуйста ваше имя: ')
print(f'Здравствуйте, {user_name}')
