"""
Упражнение 1. Почтовый адрес
(Решено. 9 строк)
Напишите несколько строк кода, выводящих на экран ваше имя и почто-
вый адрес. Адрес напишите в формате, принятом в вашей стране. Ника-
кого ввода от пользователя ваша первая программа принимать не будет,
только вывод на экран и больше ничего.
"""


print("Мое имя: my_name")
print("Мой почтовый адресс name@gmail.com")
